<?php

namespace Mozakar\Gateway\Novinpal;

use Mozakar\Gateway\Exceptions\BankException;

class NovinpalException extends BankException
{
    protected $errorCode;

    public function __construct($errorCode)
    {
        parent::__construct(data_get(@self::$errors, $errorCode, 'تراکنش ناموفق'), $errorCode);
    }

    public static $errors = [
        101 => 'آی پی سایت پذیرنده مجاز نیست',
        102 => 'ترمینال بلاک شده است',
        103 => 'آدرس بازگشتی متعلق به سایت پذیرنده نیست',
        104 => 'خطای PSP',
        105 => 'تراکنش یافت نشد',
        106 => 'شناسه مرجع اشتباه است',
        107 => 'PSP یافت نشد',
        108 => 'خطای سرور',
        109 => 'تراکنش ناموفق بوده است',
        110 => 'مبلغ اشتباه وارد شده یا کمتر از 10000 ریال است',
        111 => 'کلید API اشتباه است',
        112 => 'پذیرنده غیرفعال است',
        113 => 'شناسه سفارش اشتباه است',
        114 => 'متد ارسال شده اشتباه است',
        115 => 'ترمینال تأیید نشده است',
        116 => 'ترمینال غیرفعال است',
        117 => 'ترمینال رد شده است',
        118 => 'ترمینال تعلیق شده است',
        119 => 'ترمینالی تعریف نشده است',
        120 => 'حساب کاربری پذیرنده به حالت تعلیق درآمده است',
        121 => 'حساب کاربری پذیرنده تأیید نشده است',
        122 => 'حساب کاربری پذیرنده یافت نشد',
        123 => 'کارت نامعتبر است (عدم تطبیق کارت ارسالی با کارت پرداختی)'
    ];
}